WeSports/app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    id = params[:id] # retrieve movie ID from URI route
    @game = Game.find(id) # look up movie by unique ID

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 6]]
SELECT "games".* FROM "games" WHERE (lower(sport_name) LIKE '%basketball%')
---
  def index
    @player = Player.find(session[:user_id])
    if @player.nil?
      redirect_to '/login'
    end
    name = params[:name_search] || session[:name_search] || nil
    zip = params[:zip_search] || session[:zip_search] || nil
    @available = params[:only_available] || nil

    if params[:name_search] != session[:name_search] or params[:zip_search] != session[:zip_search] or params[:only_available] != session[:only_available]
      session[:name_search] = name
      session[:zip_search] = zip
      session[:only_available] = @available
      redirect_to :name_search => name, :zip_search => zip, :only_available => @available and return
    end

    if params[:only_available] == "1"
      if params[:name_search].blank? and params[:zip_search].blank?
        @games = Game.all().where("slots_to_be_filled != slots_taken")

SELECT "games".* FROM "games"
---
      end
    else
      if params[:name_search].blank? and params[:zip_search].blank?
        @games = Game.all()

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 2]]
---
  def join
    @game = Game.find params[:id]

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "games" SET "sport_name" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["sport_name", "New Sport"], ["updated_at", "2021-11-17 05:16:39.018992"], ["id", 6]]
---
  def update
    @game = Game.find params[:id]
    valid, notice = @game.update_game(game_params())