WeSports/app/controllers/sessions_controller.rb

INSERT INTO "players" ("uid", "provider", "username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def omniauth  #log users in with omniauth
        user = Player.create_from_omniauth(auth)